apache/nuttx/arch/arm/src/s32k1xx/hardware/s32k1xx_flexcan.h
/************************************************************************************************************
 * arch/arm/src/s32k1xx/hardware/s32k1xx_flexcan.h
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ************************************************************************************************************/

#ifndef __ARCH_ARM_SRC_S32K1XX_HARDWARE_S32K1XX_FLEXCAN_H
#define __ARCH_ARM_SRC_S32K1XX_HARDWARE_S32K1XX_FLEXCAN_H

/************************************************************************************************************
 * Included Files
 ************************************************************************************************************/

#include <nuttx/config.h>
#include <hardware/s32k1xx_memorymap.h>

/************************************************************************************************************
 * Pre-processor Definitions
 ************************************************************************************************************/

/* Register Offsets *****************************************************************************************/

#define S32K1XX_CAN_MCR_OFFSET        0x0000  /* Module Configuration Register */
#define S32K1XX_CAN_CTRL1_OFFSET      0x0004  /* Control 1 Register */
#define S32K1XX_CAN_TIMER_OFFSET      0x0008  /* Free Running Timer */
#define S32K1XX_CAN_RXMGMASK_OFFSET   0x0010  /* Rx Mailboxes Global Mask Register */
#define S32K1XX_CAN_RX14MASK_OFFSET   0x0014  /* Rx 14 Mask Register */
#define S32K1XX_CAN_RX15MASK_OFFSET   0x0018  /* Rx 15 Mask Register */
#define S32K1XX_CAN_ECR_OFFSET        0x001c  /* Error Counter */
#define S32K1XX_CAN_ESR1_OFFSET       0x0020  /* Error and Status 1 Register */
#define S32K1XX_CAN_IMASK2_OFFSET     0x0024  /* Interrupt Masks 2 Register */
#define S32K1XX_CAN_IMASK1_OFFSET     0x0028  /* Interrupt Masks 1 Register */
#define S32K1XX_CAN_IFLAG2_OFFSET     0x002c  /* Interrupt Flags 2 Register */
#define S32K1XX_CAN_IFLAG1_OFFSET     0x0030  /* Interrupt Flags 1 Register */
#define S32K1XX_CAN_CTRL2_OFFSET      0x0034  /* Control 2 Register */
#define S32K1XX_CAN_ESR2_OFFSET       0x0038  /* Error and Status 2 Register */
#define S32K1XX_CAN_CRCR_OFFSET       0x0044  /* CRC Register */
#define S32K1XX_CAN_RXFGMASK_OFFSET   0x0048  /* Rx FIFO Global Mask Register */
#define S32K1XX_CAN_RXFIR_OFFSET      0x004c  /* Rx FIFO Information Register */
#define S32K1XX_CAN_CBT_OFFSET        0x0050  /* CAN Bit Timing register */

#define S32K1XX_CAN_MB_OFFSET         0x0080  /* CAN MB register */

#define S32K1XX_CAN_RXIMR_OFFSET(n)   (0x0880 + ((n) << 2))
#  define S32K1XX_CAN_RXIMR0_OFFSET   0x0880  /* R0 Individual Mask Registers */
#  define S32K1XX_CAN_RXIMR1_OFFSET   0x0884  /* R1 Individual Mask Registers */
#  define S32K1XX_CAN_RXIMR2_OFFSET   0x0888  /* R2 Individual Mask Registers */
#  define S32K1XX_CAN_RXIMR3_OFFSET   0x088c  /* R3 Individual Mask Registers */
#  define S32K1XX_CAN_RXIMR4_OFFSET   0x0890  /* R4 Individual Mask Registers */
#  define S32K1XX_CAN_RXIMR5_OFFSET   0x0894  /* R5 Individual Mask Registers */
#  define S32K1XX_CAN_RXIMR6_OFFSET   0x0898  /* R6 Individual Mask Registers */
#  define S32K1XX_CAN_RXIMR7_OFFSET   0x089c  /* R7 Individual Mask Registers */
#  define S32K1XX_CAN_RXIMR8_OFFSET   0x08a0  /* R8 Individual Mask Registers */
#  define S32K1XX_CAN_RXIMR9_OFFSET   0x08a4  /* R9 Individual Mask Registers */
#  define S32K1XX_CAN_RXIMR10_OFFSET  0x08a8  /* R10 Individual Mask Registers */
#  define S32K1XX_CAN_RXIMR11_OFFSET  0x08ac  /* R11 Individual Mask Registers */
#  define S32K1XX_CAN_RXIMR12_OFFSET  0x08b0  /* R12 Individual Mask Registers */
#  define S32K1XX_CAN_RXIMR13_OFFSET  0x08b4  /* R13 Individual Mask Registers */
#  define S32K1XX_CAN_RXIMR14_OFFSET  0x08b8  /* R14 Individual Mask Registers */
#  define S32K1XX_CAN_RXIMR15_OFFSET  0x08bc  /* R15 Individual Mask Registers */
#  define S32K1XX_CAN_RXIMR16_OFFSET  0x08c0  /* R16 Individual Mask Registers */
#  define S32K1XX_CAN_RXIMR17_OFFSET  0x08c4  /* R17 Individual Mask Registers */
#  define S32K1XX_CAN_RXIMR18_OFFSET  0x08c8  /* R18 Individual Mask Registers */
#  define S32K1XX_CAN_RXIMR19_OFFSET  0x08cc  /* R19 Individual Mask Registers */
#  define S32K1XX_CAN_RXIMR20_OFFSET  0x08d0  /* R20 Individual Mask Registers */
#  define S32K1XX_CAN_RXIMR21_OFFSET  0x08d4  /* R21 Individual Mask Registers */
#  define S32K1XX_CAN_RXIMR22_OFFSET  0x08d8  /* R22 Individual Mask Registers */
#  define S32K1XX_CAN_RXIMR23_OFFSET  0x08dc  /* R23 Individual Mask Registers */
#  define S32K1XX_CAN_RXIMR24_OFFSET  0x08e0  /* R24 Individual Mask Registers */
#  define S32K1XX_CAN_RXIMR25_OFFSET  0x08e4  /* R25 Individual Mask Registers */
#  define S32K1XX_CAN_RXIMR26_OFFSET  0x08e8  /* R26 Individual Mask Registers */
#  define S32K1XX_CAN_RXIMR27_OFFSET  0x08ec  /* R27 Individual Mask Registers */
#  define S32K1XX_CAN_RXIMR28_OFFSET  0x08f0  /* R28 Individual Mask Registers */
#  define S32K1XX_CAN_RXIMR29_OFFSET  0x08f4  /* R29 Individual Mask Registers */
#  define S32K1XX_CAN_RXIMR30_OFFSET  0x08f8  /* R30 Individual Mask Registers */
#  define S32K1XX_CAN_RXIMR31_OFFSET  0x08fc  /* R31 Individual Mask Registers */
#define S32K1XX_CAN_RXIMR_COUNT       32      /* Individual Mask Registers Count */

