apache/nuttx/arch/arm/src/s32k1xx/hardware/s32k1xx_flexcan.h
#define S32K1XX_CAN_CTRL1_PN_OFFSET   0x0b00  /* Pretended Networking Control 1 register */
#define S32K1XX_CAN_CTRL2_PN_OFFSET   0x0b04  /* Pretended Networking Control 2 register */
#define S32K1XX_CAN_WU_MTC_OFFSET     0x0b08  /* Pretended Networking Wake Up Match register */
#define S32K1XX_CAN_FLT_ID1_OFFSET    0x0b0c  /* Pretended Networking ID Filter 1 register */
#define S32K1XX_CAN_FLT_DLC_OFFSET    0x0b10  /* Pretended Networking DLC Filter register */
#define S32K1XX_CAN_PL1_LO_OFFSET     0x0b14  /* Pretended Networking Payload Low Filter 1 register */
#define S32K1XX_CAN_PL1_HI_OFFSET     0x0b18  /* Pretended Networking Payload High Filter 1 register */

#define S32K1XX_CAN_FLT_ID2_IDMASK_OFFSET 0x0b1c  /* Pretended Networking ID Filter 2 /
                                                   * ID Mask register */
#define S32K1XX_CAN_PL2_PLMASK_LO_OFFSET  0x0b20  /* Pretended Networking Payload Low Filter 2 /
                                                   * Payload Low Mask register */
#define S32K1XX_CAN_PL2_PLMASK_HI_OFFSET  0x0b24  /* Pretended Networking Payload High Filter 2
                                                   * low order bits / Payload High Mask register */

#define S32K1XX_CAN_WMB_OFFSET(n)     (0x0b40 + ((n) << 4)
#  define S32K1XX_CAN_WMB_CS_OFFSET   0x0000  /* Wake Up Message Buffer register for C/S */
#  define S32K1XX_CAN_WMB_ID_OFFSET   0x0004  /* Wake Up Message Buffer Register for ID */
#  define S32K1XX_CAN_WMB_D03_OFFSET  0x0008  /* Wake Up Message Buffer Register for Data 0-3 */
#  define S32K1XX_CAN_WMB_D47_OFFSET  0x000c  /* Wake Up Message Buffer Register Data 4-7 */

#  define S32K1XX_CAN_WMB0_CS_OFFSET  0x0b40  /* Wake Up Message Buffer register for C/S */
#  define S32K1XX_CAN_WMB0_ID_OFFSET  0x0b44  /* Wake Up Message Buffer Register for ID */
#  define S32K1XX_CAN_WMB0_D03_OFFSET 0x0b48  /* Wake Up Message Buffer Register for Data 0-3 */
#  define S32K1XX_CAN_WMB0_D47_OFFSET 0x0b4c  /* Wake Up Message Buffer Register Data 4-7 */
#  define S32K1XX_CAN_WMB1_CS_OFFSET  0x0b50  /* Wake Up Message Buffer register for C/S */
#  define S32K1XX_CAN_WMB1_ID_OFFSET  0x0b54  /* Wake Up Message Buffer Register for ID */
#  define S32K1XX_CAN_WMB1_D03_OFFSET 0x0b58  /* Wake Up Message Buffer Register for Data 0-3 */
#  define S32K1XX_CAN_WMB1_D47_OFFSET 0x0b5c  /* Wake Up Message Buffer Register Data 4-7 */
#  define S32K1XX_CAN_WMB2_CS_OFFSET  0x0b60  /* Wake Up Message Buffer register for C/S */
#  define S32K1XX_CAN_WMB2_ID_OFFSET  0x0b64  /* Wake Up Message Buffer Register for ID */
#  define S32K1XX_CAN_WMB2_D03_OFFSET 0x0b68  /* Wake Up Message Buffer Register for Data 0-3 */
#  define S32K1XX_CAN_WMB2_D47_OFFSET 0x0b6c  /* Wake Up Message Buffer Register Data 4-7 */
#  define S32K1XX_CAN_WMB3_CS_OFFSET  0x0b70  /* Wake Up Message Buffer register for C/S */
#  define S32K1XX_CAN_WMB3_ID_OFFSET  0x0b74  /* Wake Up Message Buffer Register for ID */
#  define S32K1XX_CAN_WMB3_D03_OFFSET 0x0b78  /* Wake Up Message Buffer Register for Data 0-3 */
#  define S32K1XX_CAN_WMB3_D47_OFFSET 0x0b7c  /* Wake Up Message Buffer Register Data 4-7 */

#define S32K1XX_CAN_FDCTRL_OFFSET     0x0c00  /* CAN FD Control register */
#define S32K1XX_CAN_FDCBT_OFFSET      0x0c04  /* CAN FD Bit Timing register */
#define S32K1XX_CAN_FDCRC_OFFSET      0x0c08  /* CAN FD CRC register */

/* Register Addresses ***************************************************************************************/

#define S32K1XX_CAN0_MCR              (S32K1XX_FLEXCAN0_BASE + S32K1XX_CAN_MCR_OFFSET)
#define S32K1XX_CAN0_CTRL1            (S32K1XX_FLEXCAN0_BASE + S32K1XX_CAN_CTRL1_OFFSET)
#define S32K1XX_CAN0_TIMER            (S32K1XX_FLEXCAN0_BASE + S32K1XX_CAN_TIMER_OFFSET)
#define S32K1XX_CAN0_RXMGMASK         (S32K1XX_FLEXCAN0_BASE + S32K1XX_CAN_RXMGMASK_OFFSET)
#define S32K1XX_CAN0_RX14MASK         (S32K1XX_FLEXCAN0_BASE + S32K1XX_CAN_RX14MASK_OFFSET)
#define S32K1XX_CAN0_RX15MASK         (S32K1XX_FLEXCAN0_BASE + S32K1XX_CAN_RX15MASK_OFFSET)
#define S32K1XX_CAN0_ECR              (S32K1XX_FLEXCAN0_BASE + S32K1XX_CAN_ECR_OFFSET)
#define S32K1XX_CAN0_ESR1             (S32K1XX_FLEXCAN0_BASE + S32K1XX_CAN_ESR1_OFFSET)
#define S32K1XX_CAN0_IMASK2           (S32K1XX_FLEXCAN0_BASE + S32K1XX_CAN_IMASK2_OFFSET)
#define S32K1XX_CAN0_IMASK1           (S32K1XX_FLEXCAN0_BASE + S32K1XX_CAN_IMASK1_OFFSET)
#define S32K1XX_CAN0_IFLAG2           (S32K1XX_FLEXCAN0_BASE + S32K1XX_CAN_IFLAG2_OFFSET)
#define S32K1XX_CAN0_IFLAG1           (S32K1XX_FLEXCAN0_BASE + S32K1XX_CAN_IFLAG1_OFFSET)
#define S32K1XX_CAN0_CTRL2            (S32K1XX_FLEXCAN0_BASE + S32K1XX_CAN_CTRL2_OFFSET)
#define S32K1XX_CAN0_ESR2             (S32K1XX_FLEXCAN0_BASE + S32K1XX_CAN_ESR2_OFFSET)
#define S32K1XX_CAN0_CRCR             (S32K1XX_FLEXCAN0_BASE + S32K1XX_CAN_CRCR_OFFSET)
#define S32K1XX_CAN0_RXFGMASK         (S32K1XX_FLEXCAN0_BASE + S32K1XX_CAN_RXFGMASK_OFFSET)
#define S32K1XX_CAN0_RXFIR            (S32K1XX_FLEXCAN0_BASE + S32K1XX_CAN_RXFIR_OFFSET)
#define S32K1XX_CAN0_CBT              (S32K1XX_FLEXCAN0_BASE + S32K1XX_CAN_CBT_OFFSET)
#define S32K1XX_CAN0_MB               (S32K1XX_FLEXCAN0_BASE + S32K1XX_CAN_MB_OFFSET)
#define S32K1XX_CAN0_FDCTRL           (S32K1XX_FLEXCAN0_BASE + S32K1XX_CAN_FDCTRL_OFFSET)
#define S32K1XX_CAN0_FDCBT            (S32K1XX_FLEXCAN0_BASE + S32K1XX_CAN_FDCBT_OFFSET)
#define S32K1XX_CAN0_FDCRC            (S32K1XX_FLEXCAN0_BASE + S32K1XX_CAN_FDCRC_OFFSET)

#define S32K1XX_CAN0_RXIMR(n)         (S32K1XX_FLEXCAN0_BASE + S32K1XX_CAN_RXIMR_OFFSET(n))
#  define S32K1XX_CAN0_RXIMR0         (S32K1XX_FLEXCAN0_BASE + S32K1XX_CAN_RXIMR0_OFFSET)
#  define S32K1XX_CAN0_RXIMR1         (S32K1XX_FLEXCAN0_BASE + S32K1XX_CAN_RXIMR1_OFFSET)
#  define S32K1XX_CAN0_RXIMR2         (S32K1XX_FLEXCAN0_BASE + S32K1XX_CAN_RXIMR2_OFFSET)
#  define S32K1XX_CAN0_RXIMR3         (S32K1XX_FLEXCAN0_BASE + S32K1XX_CAN_RXIMR3_OFFSET)
#  define S32K1XX_CAN0_RXIMR4         (S32K1XX_FLEXCAN0_BASE + S32K1XX_CAN_RXIMR4_OFFSET)
#  define S32K1XX_CAN0_RXIMR5         (S32K1XX_FLEXCAN0_BASE + S32K1XX_CAN_RXIMR5_OFFSET)
#  define S32K1XX_CAN0_RXIMR6         (S32K1XX_FLEXCAN0_BASE + S32K1XX_CAN_RXIMR6_OFFSET)
#  define S32K1XX_CAN0_RXIMR7         (S32K1XX_FLEXCAN0_BASE + S32K1XX_CAN_RXIMR7_OFFSET)
#  define S32K1XX_CAN0_RXIMR8         (S32K1XX_FLEXCAN0_BASE + S32K1XX_CAN_RXIMR8_OFFSET)
#  define S32K1XX_CAN0_RXIMR9         (S32K1XX_FLEXCAN0_BASE + S32K1XX_CAN_RXIMR9_OFFSET)
#  define S32K1XX_CAN0_RXIMR10        (S32K1XX_FLEXCAN0_BASE + S32K1XX_CAN_RXIMR10_OFFSET)
#  define S32K1XX_CAN0_RXIMR11        (S32K1XX_FLEXCAN0_BASE + S32K1XX_CAN_RXIMR11_OFFSET)
#  define S32K1XX_CAN0_RXIMR12        (S32K1XX_FLEXCAN0_BASE + S32K1XX_CAN_RXIMR12_OFFSET)
#  define S32K1XX_CAN0_RXIMR13        (S32K1XX_FLEXCAN0_BASE + S32K1XX_CAN_RXIMR13_OFFSET)
#  define S32K1XX_CAN0_RXIMR14        (S32K1XX_FLEXCAN0_BASE + S32K1XX_CAN_RXIMR14_OFFSET)
#  define S32K1XX_CAN0_RXIMR15        (S32K1XX_FLEXCAN0_BASE + S32K1XX_CAN_RXIMR15_OFFSET)
#  define S32K1XX_CAN0_RXIMR16        (S32K1XX_FLEXCAN0_BASE + S32K1XX_CAN_RXIMR16_OFFSET)
#  define S32K1XX_CAN0_RXIMR17        (S32K1XX_FLEXCAN0_BASE + S32K1XX_CAN_RXIMR17_OFFSET)
#  define S32K1XX_CAN0_RXIMR18        (S32K1XX_FLEXCAN0_BASE + S32K1XX_CAN_RXIMR18_OFFSET)
#  define S32K1XX_CAN0_RXIMR19        (S32K1XX_FLEXCAN0_BASE + S32K1XX_CAN_RXIMR19_OFFSET)
#  define S32K1XX_CAN0_RXIMR20        (S32K1XX_FLEXCAN0_BASE + S32K1XX_CAN_RXIMR20_OFFSET)
#  define S32K1XX_CAN0_RXIMR21        (S32K1XX_FLEXCAN0_BASE + S32K1XX_CAN_RXIMR21_OFFSET)
#  define S32K1XX_CAN0_RXIMR22        (S32K1XX_FLEXCAN0_BASE + S32K1XX_CAN_RXIMR22_OFFSET)
#  define S32K1XX_CAN0_RXIMR23        (S32K1XX_FLEXCAN0_BASE + S32K1XX_CAN_RXIMR23_OFFSET)
#  define S32K1XX_CAN0_RXIMR24        (S32K1XX_FLEXCAN0_BASE + S32K1XX_CAN_RXIMR24_OFFSET)
#  define S32K1XX_CAN0_RXIMR25        (S32K1XX_FLEXCAN0_BASE + S32K1XX_CAN_RXIMR25_OFFSET)
#  define S32K1XX_CAN0_RXIMR26        (S32K1XX_FLEXCAN0_BASE + S32K1XX_CAN_RXIMR26_OFFSET)
#  define S32K1XX_CAN0_RXIMR27        (S32K1XX_FLEXCAN0_BASE + S32K1XX_CAN_RXIMR27_OFFSET)
#  define S32K1XX_CAN0_RXIMR28        (S32K1XX_FLEXCAN0_BASE + S32K1XX_CAN_RXIMR28_OFFSET)
#  define S32K1XX_CAN0_RXIMR29        (S32K1XX_FLEXCAN0_BASE + S32K1XX_CAN_RXIMR29_OFFSET)
#  define S32K1XX_CAN0_RXIMR30        (S32K1XX_FLEXCAN0_BASE + S32K1XX_CAN_RXIMR30_OFFSET)
#  define S32K1XX_CAN0_RXIMR31        (S32K1XX_FLEXCAN0_BASE + S32K1XX_CAN_RXIMR31_OFFSET)

#define S32K1XX_CAN0_CTRL1_PN         (S32K1XX_FLEXCAN0_BASE + S32K1XX_CAN_CTRL1_PN_OFFSET)
#define S32K1XX_CAN0_CTRL2_PN         (S32K1XX_FLEXCAN0_BASE + S32K1XX_CAN_CTRL2_PN_OFFSET)
#define S32K1XX_CAN0_WU_MTC           (S32K1XX_FLEXCAN0_BASE + S32K1XX_CAN_WU_MTC_OFFSET)
#define S32K1XX_CAN0_FLT_ID1          (S32K1XX_FLEXCAN0_BASE + S32K1XX_CAN_FLT_ID1_OFFSET)
#define S32K1XX_CAN0_FLT_DLC          (S32K1XX_FLEXCAN0_BASE + S32K1XX_CAN_FLT_DLC_OFFSET)
#define S32K1XX_CAN0_PL1_LO           (S32K1XX_FLEXCAN0_BASE + S32K1XX_CAN_PL1_LO_OFFSET)
#define S32K1XX_CAN0_PL1_HI           (S32K1XX_FLEXCAN0_BASE + S32K1XX_CAN_PL1_HI_OFFSET)

